spring-back-end/src/test/resources/ehis/generated_soap_v6.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ehis="http://producers.ehis.xtee.riik.ee/producer/ehis" xmlns:iden="http://x-road.eu/xsd/identifiers" xmlns:xro="http://x-road.eu/xsd/xroad.xsd"><SOAP-ENV:Header><xro:issue>ehis</xro:issue><xro:protocolVersion>4.0</xro:protocolVersion><xro:id>28255f1a-0256-4f26-ae3d-2bb3b8c79266</xro:id><xro:userId>123</xro:userId><xro:service iden:objectType="SERVICE"><iden:xRoadInstance>ee</iden:xRoadInstance><iden:memberClass>gov</iden:memberClass><iden:memberCode>70000740</iden:memberCode><iden:subsystemCode>ehis</iden:subsystemCode><iden:serviceCode>isiku_rollid</iden:serviceCode><iden:serviceVersion>v1</iden:serviceVersion></xro:service><xro:client iden:objectType="SUBSYSTEM"><iden:xRoadInstance>ee</iden:xRoadInstance><iden:memberClass>gov</iden:memberClass><iden:memberCode>10585438</iden:memberCode><iden:subsystemCode>10585438</iden:subsystemCode></xro:client></SOAP-ENV:Header><SOAP-ENV:Body><ehis:isikuRollid><isikukood>123</isikukood></ehis:isikuRollid></SOAP-ENV:Body></SOAP-ENV:Envelope>